# taps
tap "felixkratz/formulae"
tap "koekeishiya/formulae"
tap "mattresspadley/tap"
tap "homebrew/cask"

# My Packages
brew "bat"
brew "btop"
brew "docker-compose"
brew "dysk"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-lfs"
brew "glow"
brew "glfw"
brew "ifstat"
brew "jq"
brew "just"
brew "kitty"
brew "lazydocker"
brew "lazygit"
brew "lnav"
brew "liblo"
brew "neovim"
brew "platformio"
brew "portaudio"
brew "starship"
brew "stow"
brew "thefuck"
brew "tmux"
brew "trash", link: true
brew "wget"
brew "yazi"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "mattresspadley/tap/bump"
brew "mattresspadley/tap/newnew"
cask "font-ubuntu-nerd-font"
cask "font-ubuntu-sans-nerd-font"
cask "git-credential-manager"
cask "sf-symbols"
cask "sol"
cask "bruno"

# C Tools
brew "cmake"
brew "cppcheck"
brew "ninja"
brew "doxygen"
brew "sdl2"
brew "shaderc"

# Python
brew "uv"

#Javascript
brew "node"
brew "bun"

brew "icu4c@76"
brew "tinyxml2"
brew "flac"
brew "pango"
brew "sdl2"
brew "fswatch"
brew "gdk-pixbuf"
brew "gnupg"
brew "graphviz"
brew "libffi"
brew "liblo"
brew "llvm"
brew "nlohmann-json"
brew "protobuf"
brew "qt"
brew "opencv"
brew "picocom"
brew "tlrc"

